#Write a Pandas program to remove the duplicates from 'WHO region' column of World alcohol consumption dataset.Write a Pandas program to remove the duplicates from 'WHO region' column of World alcohol consumption dataset.

In [1]:
import pandas as pd

In [4]:
df=pd.DataFrame({'Year':[1986,1986,1985,1986,1987],'WHO region':['Western Pacific','Americas','Africa','Americas','Americas'],'Country Beverage':['VietNam','Uruguay','Cte d lvoire','Colombia','Saint kitts & Nevis'],'Types':['wine','other','wine','beer','beer'],'Display Value':[0.00,0.50,1.62,4.27,1.98]})

In [5]:
df

   Year       WHO region     Country Beverage  Types  Display Value
0  1986  Western Pacific              VietNam   wine           0.00
1  1986         Americas              Uruguay  other           0.50
2  1985           Africa         Cte d lvoire   wine           1.62
3  1986         Americas             Colombia   beer           4.27
4  1987         Americas  Saint kitts & Nevis   beer           1.98

In [6]:
df1=df.drop_duplicates('WHO region')

In [8]:
df1

   Year       WHO region Country Beverage  Types  Display Value
0  1986  Western Pacific          VietNam   wine           0.00
1  1986         Americas          Uruguay  other           0.50
2  1985           Africa     Cte d lvoire   wine           1.62

#Write a Pandas program to find out the alcohol consumption details in the year '1987' or '1989' from the world alcohol consumption dataset.

In [9]:
df[(df['Year']==1987) | (df['Year']==1989)]

   Year WHO region     Country Beverage Types  Display Value
4  1987   Americas  Saint kitts & Nevis  beer           1.98